app/Controllers/CommentController.php

INSERT INTO `comments` (`post_id`, `comment`, `user_id`) VALUES ('1', 'super nice', '2')
---
    public function addCommentInView($id) {
        $error = [];

        $rules = [
            'post_id' => 'required',
            'comment' => 'required'
        ];

        if ($this->validate($rules)) {
            $data = [
                'post_id' => $this->request->getPost('post_id'),
                'comment' => $this->request->getPost('comment'),
                'user_id' => $this->session->get('id')
            ];

            $save = $this->comment->save($data);

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT *
FROM `comments`
---
    public function view_comment()
    {

        $users_info = $this->user->find($this->session->get('id'));

        // fetching all comments from db
        $all_comments = $this->comment->findAll();