app/Controllers/MainController.php

    public function home()
    {
        $view_posts = $this->post->orderBy('id', 'DESC')->limit(10)->findAll();
---
SELECT *
FROM `posts`
ORDER BY `id` DESC
 LIMIT 10