app/Controllers/MainController.php

SELECT *
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
ORDER BY `posts`.`post_id` DESC
 LIMIT 10
SELECT *
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
ORDER BY `posts`.`post_id` DESC
---
    public function home()
    {


        // fetching data from db and also linking two tables to get the user info

        $view_posts = $this->post->join('users', 'users.id = posts.user_id')->orderBy('posts.post_id', 'DESC')->limit(10)->findAll();

        $all_posts = $this->post->join('users', 'users.id = posts.user_id')->orderBy('posts.post_id', 'DESC')->findAll();

SELECT *
FROM `posts`
ORDER BY `id` DESC
---
    public function content()
    {

        $all_posts = $this->post->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `posts`
ORDER BY `post_id` DESC
 LIMIT 1
SELECT *
FROM `posts`
WHERE `id` = '4'
 LIMIT 1
SELECT *
FROM `users`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `comments`
WHERE `post_id` = '3'
---
    public function post()
    {

        $latest_post = $this->post->orderBy('post_id', 'DESC')->first();

        // getting the authors informations

        $author = $this->user->where('id', $latest_post['user_id'])->first();

        // viewing all comment on this post

        $comments = $this->comment->where('post_id', $latest_post['post_id'])->findAll();

SELECT *
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
WHERE `posts`.`post_id` = '2'
 LIMIT 1
SELECT *
FROM `comments`
WHERE `id` = '2'
---
    public function view_post($id)
    {

        // getting the authors informations

        // $single_post = $this->post->where('posid', $id)->first();

        $single_post = $this->post->where('posts.post_id', $id)->join('users', 'users.id = posts.user_id')->first();


        // viewing all comment on this post

        $comments = $this->comment->where('id', $id)->findAll();