app/Controllers/PostController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function create()
    {
        $users_info = $this->user->find($this->session->get('id'));

INSERT INTO `posts` (`title`, `content`, `image`, `user_id`) VALUES ('the life comfort', 'Lorem ipsum, dolor sit amet consectetur adipisicing elit. Provident obcaecati magnam omnis molestias consectetur accusantium dolorum rerum molestiae sunt tempore explicabo debitis, quisquam rem cum autem laborum delectus? Earum voluptas dolores maxime officia dolorum repudiandae corrupti commodi, doloremque fuga a sint, at nostrum vero obcaecati error voluptatum itaque atque quae nam fugit. Voluptas numquam pariatur harum. Vitae maxime odit vel nobis, praesentium excepturi error beatae necessitatibus ut tempore quisquam eligendi quaerat architecto dolorem consectetur ducimus enim quas ipsam perspiciatis esse neque odio sunt molestias libero? Rem fuga libero facere, odio nisi ratione dolorem totam et ab quod beatae animi tenetur!', 'empty', '2')
---
                function image_control($image_file)
                {
                    if ($image_file == '') {

                        return 'empty';
                    } else {

                        $fileName = $image_file->getName();

                        $fileNamechange = explode('.', $fileName);

                        $newFileName = random_int(1000000, 9999999) . 'post' . time() . '.' . end($fileNamechange);

                        $image_file->move('public/assets/images/post', $newFileName);

                        return $newFileName;
                    }
                }


                $data = [
                    'title' => htmlspecialchars($this->request->getPost('title')),
                    'content' => htmlspecialchars($this->request->getPost('content')),
                    'image' => image_control($image_file),
                    'user_id' => $this->session->get('id')
                ];

                if ($this->post->save($data)) {

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT *
FROM `posts`
---
    public function list_post()
    {

        $users_info = $this->user->find($this->session->get('id'));

        // fetching all post from db

        $all_posts = $this->post->findAll();