app/Controllers/UserController.php

    public function login()
    {


        // first validate your login

        $errors = [];

        if (isset($_POST['submit'])) {
            $rules = [
                'email' => 'required|valid_email'
            ];

            if ($this->validate($rules)) {

                // searching for the email in db
                $email = $this->request->getPost('email');

                $validateEmail = $this->user->where('email', $email)->find();
---
SELECT *
FROM `users`
WHERE `email` = 'adielawrence4@gmal.com'

    public function admin_user() {

        $users_info = $this->user->find($this->session->get('id'));

        // to fetch all users
        $all_users = $this->user->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT *
FROM `users`